In [ ]:
'''Задание 1: Основы программирования на Python
Описание: Напишите функцию, которая принимает список чисел и возвращает список квадратов этих чисел.''' 

def squaring(data):
    '''Возведение чисел в квадрат'''
    for i in range(len(data)):
        my_list[i] *= 2
    return my_list

my_list = [1.1, 1000.7, 3, 3, 13, 3, 6, 6, 7, 9, 9, 8, 9, 10, 10, 11, 12, 3, 14, 14, 14, 15, 15, 500]
print(squaring(my_list))

In [ ]:
'''Задание 2: Структуры данных в Python
Описание : Напишите функцию, которая принимает строку и возвращает словарь, 
где ключами являются символы строки, а значениями – количество их вхождений встроку'''

from collections import Counter

def counter_symbol(text):
    list = [i for i in text if i]  # Достанем в список все символы строки (включая перенос строки)
    return Counter(list)

string = '''высокоуровневый язык программирования общего назначения с динамической строгой
            типизацией и автоматическим управлением памятью...'''

print(counter_symbol(string))

In [ ]:
'''Задание 3: Библиотеки

Описание: Используйте встроенный датасет titanic из библиотеки seaborn и выполните следующие задания:

1. Выведите первые 5 строк DataFrame.
2. Замените все пропущенные значения в столбце age средним значением по этому столбцу.
3. Создайте новый столбец age_category, который будет содержать категориальные 
значения "Child", "Adult" и "Senior" на основе возраста (age)'''

import seaborn as sns

data = sns.load_dataset("titanic")
data.head()  # Первые 5 строк DataFrame

In [ ]:
data.isna().sum()  # Смотрим, сколько данных пропущенно

In [ ]:
mean = data['age'].mean()
data['age'] = data['age'].fillna(mean)  # Заменяем все пропуски средним значением по этому столбцу

In [ ]:
data.isna().sum()  # Проверяем, что все недостающие данные в столбце заменены

In [ ]:
# Создаём новый столбец age_category, который будет содержать категориальные значения "Child", "Adult" и "Senior" на основе возраста (age)

data['age_category'] = data['age'].apply(lambda x: 'Child' if x < 18 else ('Adult' if 18 <= x < 50 else 'Senior'))
data.head(20)  # Смотрим первые 20 строк, чтобы увидеть результат

In [9]:
'''Задание 4: Манипуляции и анализ данных
Описание: Продолжаем работу с датасетом titanic. Используя Pandas и датасет titanic из 
библиотеки seaborn, выполните следующие задания:
1. Выполните группировку данных по столбцу class и вычислите среднее значение для каждого класса по столбцу fare.
2. Постройте график распределения данных по столбцу age.
3. Постройте тепловую карту корреляционной матрицы числовых переменных.'''

import seaborn as sns

data = sns.load_dataset("titanic")
data.head(25)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
20,0,2,male,35.0,0,0,26.0000,S,Second,man,True,NaN,Southampton,no,True
21,1,2,male,34.0,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
24,0,3,female,8.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False